` # module.secrets.aws_ssm_parameter.secret_parameters["psc_statement_data_api_key"] will be created
  + resource "aws_ssm_parameter" "secret_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "psc_statement_data_api_key"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "3890acb0-0dc1-4927-975f-a2492279174b"
      + name           = "/psc-statement-delta-consumer-cidev/psc_statement_data_api_key"
      + overwrite      = true
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.secrets.aws_ssm_parameter.secret_parameters["psc_statement_salt"] will be created
  + resource "aws_ssm_parameter" "secret_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "psc_statement_salt"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "3890acb0-0dc1-4927-975f-a2492279174b"
      + name           = "/psc-statement-delta-consumer-cidev/psc_statement_salt"
      + overwrite      = true
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.`
